import { H3 } from "~/components/heading";

export const AboutTeamsAi = () => {
	return (
		<>
			<H3>広義 AI 班</H3>
			<p>
				<strong>2025 年度新設</strong>
			</p>
			<p>
				広義 AI 活動班では、まず「手の形状検出
				AI」の基礎部分の完成を目標としながら、人工知能の概要とその仕組み、人工知能の構成要素とそれを構築することに対する必要知識などの基礎知識を身に着けていきます。
				ゆくゆくは、手を動かすだけで PC
				やスマホを操作できる「ジェスチャー操作」への組み込みや、手以外のものを対象とした検出
				AI
				の作成など、形状検出を応用したプログラムを各々が作ることができるようにします！
			</p>
			<p>
				回帰や分類、生成などの機械学習の分野に限らず、 AtCoder Heuristic Contest
				(AHC) や ICFPC などで問われる「ルールベース」の AI も扱っているため
				"広義" AI 班と名付けています。
			</p>
			<p>
				活動は主に週に 1
				度の頻度で、集めた情報や技術について話し合う、自分の作成したものを見せ合うなどを行います。
			</p>
			<p>
				班員は皆、今年度から知識 0 でのスタートです！
				しかしあなたの発想力によって、活動内容は無限の広がりを見せます！
				ぜひ気軽に参加してみてください！！
			</p>
		</>
	);
};
