import { H3 } from "~/components/heading";

export const AboutTeamsAnimation = () => {
	return (
		<>
			<H3>アニメーション班</H3>
			<p>
				<strong>2026 年度新設</strong>
			</p>
			<p>
				アニメーション班では、その名の通りアニメーション作成を行っていきます。
			</p>
			<p>
				新設したばかりの班のため、 1 から勉強しながらの活動となります。
				内容としては Blender を使って Web
				サイトに使えるようなショートアニメーションの作成になります。
				班員は募集中です。 ほかの班同様 GitHub
				を使うので新入生はウェブ研へ参加することをお勧めします。
			</p>
			<p>
				週に 1
				回の進捗共有を行い、アニメーションが出来上がったら発表会を行います。
				ものによってはサークルが運営する X や YouTube
				で公開することも考えています。
			</p>
			<p>
				どんな作品を作るかは自由です！
				みんなで気楽にアニメーション制作をしてみましょう！
			</p>
		</>
	);
};
