import { H3 } from "~/components/heading";

export const AboutTeamsGameDev = () => {
	return (
		<>
			<H3>ゲーム開発班</H3>
			<p>
				<strong>2025 年度新設</strong>
			</p>
			<p>
				ゲーム開発班ではウェブサイトなどを使って色々なゲームを作っていきます。
			</p>
			<p>
				まずは比較的簡単なパズルゲームから作り始め、シューティングや対戦型のボードゲームまで作れるようにすることを目標にしています。
				当面は Ubuntu サーバー上で Web サイトを作り、そこで HTML や CSS、
				JavaScript を用いてゲームを作っていこうと思います。
				そのために先ずはほかの班と同様に Web サイトの作り方を学びます。
			</p>
			<p>
				活動としてまずは基礎固めをして、その後は開発に使えそうなレクチャーをしながら共同開発をしようと思っています。
				初心者大歓迎なので、工学部ではない方も是非お越しください！
			</p>
		</>
	);
};
