import { H3 } from "~/components/heading";

export const AboutTeamsInfra = () => {
	return (
		<>
			<H3>インフラ班</H3>
			<p>
				<strong>2025 年度新設</strong>
			</p>
			<p>
				インフラ班では主に、 AWS、 Ubuntu サーバを利用した Web
				サイトの公開、仮想マシンの構築、 Minecraft
				サーバの構築などを可能にするための勉強を行います！
			</p>
			<p>
				Ubuntu サーバを利用した Web
				サイトの公開では、サイトの公開までの手順を実際に行い、生じた疑問を調べながら解消することで概形を把握し、操作に慣れることを目的としています。
				仮想マシンの構築では、 Ubuntu をホスト OS として qemu-kvm
				で仮想マシンを構築し、それを外部に公開する方法を勉強します！
			</p>
			<p>
				今年から新しくできた班なので、メンバーもそれぞれ学びながら活動をしています。
				各々がそれぞれやりたいことを自主的に学び、その知識をお互いに教え合うことで、インフラの知識をしっかりと身につけることを目標にしています！
			</p>
		</>
	);
};
