import { H3 } from "~/components/heading";

export const AboutTeamsMobileApp = () => {
	return (
		<>
			<H3>モバイルアプリ班</H3>
			<p>
				<strong>2025 年度新設</strong>
			</p>
			<p>
				モバイルアプリ班では、その名の通りモバイルアプリの開発を行っていきます。
			</p>
			<p>
				今年から新しくできた班なので、メンバーもそれぞれ学びながら活動をしています。
				各々がそれぞれやりたいことを自主的に学び、その知識をお互いに教え合うことで、インフラの知識をしっかりと身につけることを目標にしています！
				3 - 4 人チームでの開発か個人開発の、好きな方を選ぶことができます。
				また、開発言語としては Flutter を使用しての開発となります！
			</p>
			<p>
				週に 1, 2 回の進捗共有を行い、活動開始から 3 ヶ月 -
				半年でプロダクトの発表会を行います。
			</p>
			<p>
				どんなアプリを作るかは自由です！
				みんなで気楽にアプリ開発をしてみましょう！
			</p>
		</>
	);
};
