import { H3 } from "~/components/heading";

export const AboutTeamsMobileApp = () => {
	return (
		<>
			<H3>アニメーション班</H3>
			<p>
				<strong>2026 年度新設</strong>
			</p>
			<p>
				アニメーション班では、その名の通りアニメーションの開発を行っていきます。
			</p>
			<p>
				新設したばかりの班のため、1から勉強しながらの活動となります。内容としてはBlenderを使ってWebサイトに使えるようなショー問
				トアニメーションの作成となります。班員は募集中です。ほかの班同様githubを使うので新入生はウェブ研へ参加することをお勧めします。
			</p>
			<p>
				週に 1回の進捗共有を行い、アニメーションが出来上がったら発表会を行います。ものによってはサークルが運営するXやYoutubeで公開することも考えています。
			</p>
			<p>
				どんな作品を作るかは自由です！
				みんなで気楽にアニメーション開発をしてみましょう！
			</p>
		</>
	);
};
